import pytest

from src.text_model import Text
from src.comparison import compare_texts


def test_compare_one_text():
    """
    Функция, которая тестирует корректность анализа одного произвдеения. 
    Метаданные учитываются.
    """

    text = Text(
        content='Вчера я был счастлив, чрезмерно счастлив, донельзя счастлив! Вы хоть раз в жизни, упрямица, меня послушались. Вечером, часов в восемь, просыпаюсь (вы знаете, маточка, что я часочек-другой люблю поспать после должности), свечку достал, приготовляю бумаги, чиню перо, вдруг, невзначай, подымаю глаза, — право, у меня сердце вот так и запрыгало!',
        title='Бедные люди', 
        author='Ф.М. Достоевский',
        year_created=1845,
        year_published=1846,
    )

    result = compare_texts([text])

    assert len(result) == 1

    # Запись с результатами анализа произведения
    row = result[0]

    assert row['Название произведения'] == 'Бедные люди'
    assert row['Автор'] == 'Ф.М. Достоевский'
    assert row['Литературная форма'] == 'Литературная форма не указана'
    assert row['Год создания'] == 1845
    assert row['Год публикации'] == 1846


def test_compare_two_texts():
    """
    Функция, которая сравнивает между собой два произвдения.
    """

    first_text = Text(
        content='Через базарную площадь идет полицейский надзиратель Очумелов в новой шинели и с узелком в руке. За ним шагает рыжий городовой с решетом, доверху наполненным конфискованным крыжовником. Кругом тишина... ',
        title='Хамелеон',
        author='А.П. Чехов',
        language_code='ru',
        literary_form='проза',
        genre='рассказ',
        year_created=1884,
        year_published=1884,
    )

    second_text = Text(
        content='Трудный этот русский язык, дорогие граждане! Беда, какой трудный. Главная причина в том, что иностранных слов в нем до черта. Ну, взять французскую речь. Все хорошо и понятно. Кескесе, мерси, комси — все, обратите ваше внимание, чисто французские, натуральные, понятные слова.',
        title='Обезьяний язык',
        author='М.М. Зощенко',
        language_code='ru',
        literary_form='проза', 
        genre='рассказ',
        year_created=1925,
        year_published=1926,
    )

    result = compare_texts([first_text, second_text])

    
    # Проверяем, что получены результаты для обоих произведений.
    assert len(result) == 2

    # Проверяем метаданные первого произведения — Чехова.
    assert result[0]["Название произведения"] == "Хамелеон"
    assert result[0]["Автор"] == "А.П. Чехов"
    assert result[0]["Язык написания"] == "ru"
    assert result[0]["Литературная форма"] == "проза"
    assert result[0]["Жанр"] == "рассказ"
    assert result[0]["Год создания"] == 1884
    assert result[0]["Год публикации"] == 1884

    # Проверяем метаданные второго произведения — Зощенко.
    assert result[1]["Название произведения"] == "Обезьяний язык"
    assert result[1]["Автор"] == "М.М. Зощенко"
    assert result[1]["Язык написания"] == "ru"
    assert result[1]["Литературная форма"] == "проза"
    assert result[1]["Жанр"] == "рассказ"
    assert result[1]["Год создания"] == 1925
    assert result[1]["Год публикации"] == 1926

    # Проверяем, что метрики рассчитаны для обоих произведений.
    assert result[0]["Количество слов"] > 0
    assert result[1]["Количество слов"] > 0

    # Проверяем, что количество слов рассчитано отдельно для каждого текста.
    assert (
        result[0]["Количество слов"]
        != result[1]["Количество слов"]
    )

